app/views/users/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."admin_id" = $1  [["admin_id", 84]]
---
        <div class="text-center m-5">
            <% user_event = Event.all.where(admin_id: @user.id) %>