app/views/events/index.html.erb

                    <h5 class="card-title"><%= event.title %></h5>
                    <p class="card-text">Cette event a ete cree par: <%= User.find(event.admin_id).email %>.</p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]