app/views/events/show.html.erb

    <p>Participer a cette event coute : <%= @event.price %>euro!</p>
    <p>event cree par: <%= User.find(@event.admin_id).email %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 74], ["LIMIT", 1]]