app/controllers/events_controller.rb

  def index
    # Méthode qui récupère tous les potins et les envoie à la view index (index.html.erb) pour affichage
    @event = Event.all
---
SELECT "events".* FROM "events"

  def show
    # Méthode qui récupère le potin concerné et l'envoie à la view show (show.html.erb) pour affichage
    if Event.last.id < params[:id].to_i || Event.first.id > params[:id].to_i
      redirect_to '/'
    else
      @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" ORDER BY "events"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]

  def create
    # Méthode qui créé un potin à partir du contenu du formulaire de new.html.erb, soumis par l'utilisateur
    # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
    # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)
    if params[:title] == "" || params[:description] == "" || params[:price] == "" || params[:location] == "" || params[:duration] == "" || params[:duration].to_i % 5 != 0 || params[:start_date] == ""
      redirect_to new_event_path
      puts "non tu a pas remplit le formulaire"
    else
      @event = Event.create!(title: params["title"], description: params["description"], price: params["price"], location: params["location"], duration: params["duration"], start_date: params["start_date"], admin_id: current_user.id)
---
INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "created_at", "updated_at", "admin_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"