app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 87], ["LIMIT", 1]]
---
  def show
    # Méthode qui récupère le potin concerné et l'envoie à la view show (show.html.erb) pour affichage
    if User.last.id < params[:id].to_i || User.first.id > params[:id].to_i
      redirect_to '/'
    else
      @user = User.find(params[:id])